# 4.9 TASK Part 1 Intro to Data Visualization with Python

## Summary of this Script
#### Q1, Q2, Q3, Q4, Q5, Q6, Q7, Q8, Q9

### Q1

##### Download the customer data set and add it to your “Original Data” folder.

### Q2

##### New script folder set up

### Q3

In [9]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [17]:
path = r"C:\Users\wallm\11 2024 Instacart Basket Analysis 1"

In [19]:
path

'C:\\Users\\wallm\\11 2024 Instacart Basket Analysis 1'

In [27]:
# Import new customer data
cust_data = pd.read_csv(os.path.join(path,'02 Data','Original data', 'customers.csv'), index_col = False)

In [35]:
cust_data.shape

(206209, 10)

In [37]:
cust_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [39]:
cust_data.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [42]:
# Check out the new imported customer data 
cust_data.head(20)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072
10,26441,Gloria,Stafford,Female,Nevada,19,1/1/2017,2,living with parents and siblings,43443
11,33835,Roger,Casey,Male,Nebraska,45,1/1/2017,2,married,47988
12,75032,Cynthia,Mcdaniel,Female,Georgia,75,1/1/2017,1,married,57835
13,51,Stephanie,Jensen,Female,Wyoming,37,1/1/2017,1,married,71190
14,516,Peter,Hunt,Male,Colorado,51,1/1/2017,2,married,146559
15,6965,Brandon,Mata,Male,North Dakota,70,1/1/2017,0,divorced/widowed,100091
16,8794,Amy,Mack,Female,Nebraska,30,1/1/2017,3,married,57096
17,9944,Brian,Oneill,Male,Wisconsin,26,1/1/2017,1,married,91826
18,13313,Victor,Moss,Male,Alaska,31,1/1/2017,2,married,91111
19,17335,Patrick,Fowler,Male,Vermont,65,1/1/2017,1,married,34514

### Q4

#### Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that don’t add anything to your analysis.

In [46]:
# Rename any columns for consistency: 
cust_data.rename(columns={
    'First Name': 'first_name', # adds lower case consistancy
    'Surnam': 'last_name', # adds consistancy with first_name and is mis-spelt
    'Gender': 'gender', # adds lower case consistancy
    'STATE': 'state', # adds lower case consistancy
    'Age': 'age', # adds lower case consistancy
    'date_joined': 'date_joined',
    'n_dependants': 'num_dependents', # adds clarity on meaning of 'n'
    'fam_status': 'family_status', # adds clarity on meaning of 'fam'
    'income': 'income'
}, inplace=True)

In [54]:
# Check new column names
cust_data.columns

Index(['user_id', 'first_name', 'last_name', 'gender', 'state', 'age',
       'date_joined', 'num_dependents', 'family_status', 'income'],
      dtype='object')

In [52]:
# Display the cleaned data
print(cust_data.head())

   user_id first_name last_name  gender       state  age date_joined  \
0    26711    Deborah  Esquivel  Female    Missouri   48    1/1/2017
1    33890   Patricia      Hart  Female  New Mexico   36    1/1/2017
2    65803    Kenneth    Farley    Male       Idaho   35    1/1/2017
3   125935   Michelle     Hicks  Female        Iowa   40    1/1/2017
4   130797        Ann   Gilmore  Female    Maryland   26    1/1/2017

   num_dependents family_status  income
0               3       married  165665
1               0        single   59285
2               2       married   99568
3               0        single   42049
4               1       married   40374

##### In this stage of the data wrangling process, there's no immediate need to drop any columns. Each column in the dataset appears to contain relevant information that could be valuable for analysis, depending on the specific goals of the project. Renaming the columns results in a clean and more logically structured dataset.

### Q5

#### Complete the fundamental data quality and consistency checks you’ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.

In [59]:
# Check for duplicates
df_dups = cust_data[cust_data.duplicated()]

In [61]:
df_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, num_dependents, family_status, income]
Index: []

##### This nil retrun suggests that there are no duplicates in the dataframe

In [67]:
# Checking missing values
cust_data.isnull().sum()

user_id               0
first_name        11259
last_name             0
gender                0
state                 0
age                   0
date_joined           0
num_dependents        0
family_status         0
income                0
dtype: int64

##### The missing first_name values in the cust_data dataframe (11,259 missing entries) indicate that a significant portion of the customers in the dataset do not have a recorded first name. This could be due to various reasons, e.g. Incomplete Data Entry, Privacy Concerns, Irrelevance to Analysis. I would suggest at this stage first names might not be critical to the dataset's purpose, and their absence likely won't hinder most types of data analysis.

In [70]:
# Check for mixed-type
cust_data.dtypes

user_id            int64
first_name        object
last_name         object
gender            object
state             object
age                int64
date_joined       object
num_dependents     int64
family_status     object
income             int64
dtype: object

##### date_joined (Object type): Although it is stored as an object (text), dates can be better handled as a datetime type for easy analysis. I could convert this if required, but not at this stage.

In [72]:
# check for mixed data types within each column
for col in cust_data.columns.tolist():
    weird = (cust_data[[col]].map(type) != cust_data[[col]].iloc[0].apply(type)).any(axis=1)
    if len(cust_data[weird]) > 0:
        print(col)

first_name

##### This shows that some rows in this column contain values of a different type than others (e.g., strings, integers, floats, or NaN), maybe due to missing values (NaN - they are treated as float type), data entry issues, importing issues.

In [77]:
# review the data type to first name column
print(cust_data['first_name'].apply(type).value_counts())

first_name
<class 'str'>      194950
<class 'float'>     11259
Name: count, dtype: int64

In [79]:
# 11,259 float values, likely due to missing values represented as NaN, hence placeholder needed
cust_data['first_name'] = cust_data['first_name'].fillna('Unknown')

In [81]:
# and ensure consistency, I will convert the entire column to string type
cust_data['first_name'] = cust_data['first_name'].astype(str)

In [83]:
# Check again the data consistancy
print(cust_data['first_name'].apply(type).value_counts())

first_name
<class 'str'>    206209
Name: count, dtype: int64

##### The column now contains consistent data types. Missing values will be handled, either filled with a placeholder or excluded if unnecessary

In [86]:
# Double check before continue
for col in cust_data.columns.tolist():
    weird = (cust_data[[col]].map(type) != cust_data[[col]].iloc[0].apply(type)).any(axis=1)
    if len(cust_data[weird]) > 0:
        print(col)

##### No listed issues, as listed before

### Q6

#### Combine your customer data with the rest of your prepared Instacart data. (Hint: Make sure the key columns are the same data type!)

In [91]:
# Import orders_products_combined_merged_aggregated data
ords_prods_merge_new =pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined_merged_aggregated.pkl'))

In [93]:
# Check the columns data type (Making sure the key columns are the same data type!)
ords_prods_merge_new.dtypes

order_id                    int64
user_id                     int64
order_number                int64
orders_day_of_week          int64
order_hour_of_day           int64
days_since_last_order     float64
product_id                  int64
add_to_cart_order           int64
reordered                   int64
_merge                   category
Unnamed: 0                  int64
product_name               object
aisle_id                    int64
department_id               int64
prices                    float64
Match                    category
busiest_day                object
busiest_period_of_day      object
max_order                   int64
loyalty_flag               object
average_spend             float64
spender_flag               object
order_median_gap          float64
customer_frequency         object
dtype: object

In [95]:
# Check the Data Types of the Key Column
print(cust_data['user_id'].dtype)  # Data type in cust_data
print(ords_prods_merge_new['user_id'].dtype)  # Data type in ords_prods_merge_new

int64
int64

In [97]:
# I no longer need _merge to track the origin of rows, you can drop it
ords_prods_merge_new.drop(columns=['_merge'], inplace=True)

In [99]:
# Merging with cust_data with ords_prods_merge_new
comb_ords_prods_cust = ords_prods_merge_new.merge(cust_data, on='user_id', indicator = True)

In [103]:
# validate the merge and confirm how rows are distributed across the two datasets.
print(comb_ords_prods_cust['_merge'].value_counts())

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

##### Confirms the 320404859 rows as previous in the data set, suggesting no missing data.

In [106]:
comb_ords_prods_cust.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,Unnamed: 0,...,first_name,last_name,gender,state,age,date_joined,num_dependents,family_status,income,_merge
0,2539329,1,1,2,8,NaN,196,1,0,195,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
1,2539329,1,1,2,8,NaN,14084,2,0,14084,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
2,2539329,1,1,2,8,NaN,12427,3,0,12427,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
3,2539329,1,1,2,8,NaN,26088,4,0,26089,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
4,2539329,1,1,2,8,NaN,26405,5,0,26406,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both

In [108]:
# Drop the 'Unnamed: 0' column as no meaning
comb_ords_prods_cust.drop(columns=['Unnamed: 0'], inplace=True)

# Confirm the column is removed
print(comb_ords_prods_cust.head())

   order_id  user_id  order_number  orders_day_of_week  order_hour_of_day  \
0   2539329        1             1                   2                  8
1   2539329        1             1                   2                  8
2   2539329        1             1                   2                  8
3   2539329        1             1                   2                  8
4   2539329        1             1                   2                  8

   days_since_last_order  product_id  add_to_cart_order  reordered  \
0                    NaN         196                  1          0
1                    NaN       14084                  2          0
2                    NaN       12427                  3          0
3                    NaN       26088                  4          0
4                    NaN       26405                  5          0

                              product_name  ...  first_name  last_name  \
0                                     Soda  ...       Linda     Nguyen
1  Organic Unsweetened Vanilla Almond Milk  ...       Linda     Nguyen
2                      Original Beef Jerky  ...       Linda     Nguyen
3               Aged White Cheddar Popcorn  ...       Linda     Nguyen
4         XL Pick-A-Size Paper Towel Rolls  ...       Linda     Nguyen

   gender    state age date_joined  num_dependents family_status  income  \
0  Female  Alabama  31   2/17/2019               3       married   40423
1  Female  Alabama  31   2/17/2019               3       married   40423
2  Female  Alabama  31   2/17/2019               3       married   40423
3  Female  Alabama  31   2/17/2019               3       married   40423
4  Female  Alabama  31   2/17/2019               3       married   40423

  _merge
0   both
1   both
2   both
3   both
4   both

[5 rows x 32 columns]

In [110]:
# Verify the resulting dataset:
print(comb_ords_prods_cust.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 32 columns):
 #   Column                 Dtype
---  ------                 -----
 0   order_id               int64
 1   user_id                int64
 2   order_number           int64
 3   orders_day_of_week     int64
 4   order_hour_of_day      int64
 5   days_since_last_order  float64
 6   product_id             int64
 7   add_to_cart_order      int64
 8   reordered              int64
 9   product_name           object
 10  aisle_id               int64
 11  department_id          int64
 12  prices                 float64
 13  Match                  category
 14  busiest_day            object
 15  busiest_period_of_day  object
 16  max_order              int64
 17  loyalty_flag           object
 18  average_spend          float64
 19  spender_flag           object
 20  order_median_gap       float64
 21  customer_frequency     object
 22  first_name             object
 23  last_name              object
 24  gender                 object
 25  state                  object
 26  age                    int64
 27  date_joined            object
 28  num_dependents         int64
 29  family_status          object
 30  income                 int64
 31  _merge                 category
dtypes: category(2), float64(4), int64(14), object(12)
memory usage: 7.3+ GB
None

### Q7

#### Ensure your notebook contains logical titles, section headings, and descriptive code comments.

### Q8

#### Export this new dataframe as a pickle file so you can continue to use it in the second part of this task.

In [117]:
# Export this new dataframe as a pickle file
comb_ords_prods_cust.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_customers_agg_merge.pkl'))

In [119]:
# confirm the file was saved
print(os.path.isfile(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_customers_agg_merge.pkl')))

True

### Q9

#### Save your notebook as part 1